request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <ns2:hello xmlns:ns2="http://lookatsoap.ilovecoding.nl/">
            <arg0>Marcus</arg0>
        </ns2:hello>
    </soap:Body>
</soap:Envelope>